-- phpMyAdmin SQL Dump
-- version 2.8.0
-- http://www.phpmyadmin.net
-- 
-- Хост: localhost
-- Время создания: Июл 18 2024 г., 11:57
-- Версия сервера: 5.5.62
-- Версия PHP: 5.3.29
-- 
-- БД: `novsu`
-- 

-- --------------------------------------------------------

-- 
-- Структура таблицы `npe_students_current_results`
-- 

CREATE TABLE `npe_students_current_results` (
  `std_id` bigint(20) NOT NULL,
  `semestr` int(11) DEFAULT NULL,
  `subject` varchar(200) COLLATE utf8_unicode_ci NOT NULL,
  `att_form` varchar(5) COLLATE utf8_unicode_ci DEFAULT NULL,
  `week9` varchar(20) COLLATE utf8_unicode_ci DEFAULT NULL,
  `rating9` varchar(20) COLLATE utf8_unicode_ci DEFAULT NULL,
  `week18` varchar(20) COLLATE utf8_unicode_ci DEFAULT NULL,
  `rating18` varchar(20) COLLATE utf8_unicode_ci DEFAULT NULL,
  `comp` varchar(500) COLLATE utf8_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- 
-- Дамп данных таблицы `npe_students_current_results`
-- 

INSERT INTO `npe_students_current_results` (`std_id`, `semestr`, `subject`, `att_form`, `week9`, `rating9`, `week18`, `rating18`, `comp`) VALUES (217942, 1, 'Иностранный язык в сфере профессиональной коммуникации', 'ДЗ', '0', ' (%)', '2', '27 (27%)', '21% УК-4'),
(217942, 1, 'Коммерциализация IT проектов', 'ДЗ', '0', ' (%)', '0', ' (%)', '67% УК-9'),
(217942, 1, 'Математика', 'ЭКЗ', '0', '0 (0%)', '3', '150 (50%)', '35% ОПК-1'),
(217942, 1, 'Основы российской государственности', 'ДЗ', '0', ' (%)', '3', '65 (65%)', '8% УК-5'),
(217942, 1, 'Психология', 'ЗАЧ', '0', ' (%)', 'зачтено', '63 (63%)', '56% УК-3;59% УК-6'),
(217942, 1, 'Структуры данных и алгоритмы', 'ЭКЗ', '2', '2 (1%)', '5', '380 (95%)', ''),
(217942, 1, 'Физика', 'ЭКЗ', '0', ' (%)', '0', ' (%)', '94% ОПК-1'),
(217942, 2, 'История России', 'ДЗ', '0', ' (%)', '0', ' (%)', '50% УК-5'),
(217942, 2, 'Моделирование систем', 'ДЗ', '0', ' (%)', '0', ' (%)', '100% ОПК-1'),
(217942, 2, 'Объектно-ориентированное программирование', 'ЭКЗ', '0', ' (%)', '5', '300 (100%)', '59% ОПК-3;93% ОПК-8'),
(217942, 2, 'Основы программирования микроконтроллеров и ПЛИС', 'ДЗ', '4', '85 (85%)', '0', ' (%)', '39% ПК-2'),
(217942, 2, 'Основы теории управления', 'ДЗ', '0', ' (%)', '0', ' (%)', '47% ПК-5'),
(217942, 2, 'Системное программирование', 'ЭКЗ', '0', ' (%)', '5', '250 (100%)', '98% ОПК-2;83% ОПК-5'),
(217942, 2, 'Системное программирование', 'КП', '', '', '5', '49 (98%)', '91% ОПК-2;71% ОПК-5'),
(217942, 2, 'Численные методы и программирование', 'ДЗ', '0', ' (%)', '0', ' (%)', '82% ОПК-3;100% ОПК-8;100% ОПК-9');
